/************************************************************************************************
*                                   SRWF-6009-BOOT
*    (c) Copyright 2015, Software Department, Sunray Technology Co.Ltd
*                               All Rights Reserved
*
* FileName     : Common.h
* Description  :
* Version      :
* Function List:
*------------------------------Revision History--------------------------------------------------
* No.   Version     Date            Revised By      Item            Description
* 1     V1.0        10/08/2015      Zhangxp         SRWF-6009-BOOT  Original Version
************************************************************************************************/
#ifndef _COMMON_H_
#define _COMMON_H_


/************************************************************************************************
*                                       Information Section
************************************************************************************************/
// 软件版本(3个字节,其中高1个字节为bootloader程序版本,低2个字节为应用程序版本)
#define BOOT_VERSION                            0x20


/************************************************************************************************
*                                   Typedef Section
************************************************************************************************/
typedef unsigned char       uint8;                      // 无符号8位整型变量
typedef signed char         int8;                       // 有符号8位整型变量
typedef unsigned short      uint16;                     // 无符号16位整型变量
typedef signed short        int16;                      // 有符号16位整型变量
typedef unsigned long       uint32;                     // 无符号32位整型变量
typedef signed long         int32;                      // 有符号32位整型变量
typedef float               fp32;                       // 单精度浮点数（32位长度）
typedef double              fp64;                       // 双精度浮点数（64位长度）
typedef unsigned char       bool;                       // 布尔类型变量


/************************************************************************************************
*                          Pubilc Macro Define Section
************************************************************************************************/
#define TRUE                                    1
#define FALSE                                   0

#define ON                                      1
#define OFF                                     0

#define HIGH                                    1
#define LOW                                     0

#define SUCCEED                                 1
#define FAILURE                                 0

#define NULL                                    0

#define CRC_SEED                                0x8408


/************************************************************************************************
*                                   Enum Define Section
************************************************************************************************/


/************************************************************************************************
*                               Struct Define Section
************************************************************************************************/


/************************************************************************************************
*                            Variable Declare Section
************************************************************************************************/


/************************************************************************************************
*                            Function Declare Section
************************************************************************************************/
extern uint16 DataCopy( uint8 * Dst, uint8 * Src, uint16 Len );
extern bool DataCompare( uint8 * Buf1, uint8 * Buf2, uint16 Len );
extern uint16 Cal_Crc( uint16 Seed, uint8 * Buf, uint32 Len );
extern void SoftReset( void );


#endif

/**************************************End of file**********************************************/


