//=============================================
//					 _ooOoo_
//					o8888888o
//					88" . "88
//					(| -_- |)
//					O\	=  /O
//				 ____/`---'\____
//			   .'  \\|	   |//	`.
//			  /  \\|||	:  |||//  \
//			 /	_||||| -:- |||||-  \
//			 |	 | \\\	-  /// |   |
//			 | \_|	''\---/''  |   |
//			 \	.-\__  `-`	___/-. /
//		   ___`. .'  /--.--\  `. . __
//		."" '<	`.___\_<|>_/___.'  >'"".
//	   | | :  `- \`.;`\ _ /`;.`/ - ` : | |
//	   \  \ `-.   \_ __\ /__ _/   .-` /  /
//======`-.____`-.___\_____/___.-`____.-'======
//					 `=---='
//^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^
//		   佛祖保佑 	  永无BUG
//  本模块已经经过开光处理，绝无可能再产生bug
//=============================================

/************************************************************************************************
*                                   SRWF-6009
*    (c) Copyright 2015, Software Department, Sunray Technology Co.Ltd
*                               All Rights Reserved
*
* FileName     : Version.h
* Description  :
* Version      :
* Function List:
*------------------------------Revision History--------------------------------------------------
* No.   Version     Date            Revised By      Item            Description
* 1     V1.0        10/08/2015      Zhangxp         SRWF-6009       Original Version
************************************************************************************************/

#ifndef  VERSION_H
#define  VERSION_H

/************************************************************************************************
*   版本发布列表
************************************************************************************************/
#define SR_JZQ6009_20151008_V001                    0   // 第一版
#define SR_JZQ6009_20160711_V002                    1
#define SR_JZQ6009_20160910_V003                    2
#define SR_JZQ6009_20161222_V004                    3
#define SR_JZQ6009_20170522_V005                    4
#define SR_JZQ6009_20171108_V006                    5
#define SR_JZQ6009_20180103_V007                    6

// 当前使用的版本
#define CURRENT_VERSION                             SR_JZQ6009_20180103_V007


/************************************************************************************************
*   版本详细描述信息
************************************************************************************************/
#if (CURRENT_VERSION == SR_JZQ6009_20151008_V001)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.第一版程序
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0100      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-SR-20160625-Vsp1.00"

#endif

#if (CURRENT_VERSION == SR_JZQ6009_20160711_V002)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.增加了上下行场强
2.增加了心跳包可设置功能
3.数据存储结构有改动
4.增加了显示IMSI编码的功能
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0101      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-20160816-Vsp1.01"

#endif

#if (CURRENT_VERSION == SR_JZQ6009_20160910_V003)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.增加了全网通模块的驱动程序
2.修改了GPRS连接的一个bug
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0102      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-20160921-Vsp1.02"

#endif

#if (CURRENT_VERSION == SR_JZQ6009_20161222_V004)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.增加了485通信接口
2.增加了大数据调试功能,需打开DataHandle中对应的注释部分
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0103      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-20161222-Vsp1.03"

#endif

#if (CURRENT_VERSION == SR_JZQ6009_20170522_V005)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.冻结数据按照新修改的协议改动
2.增加了数据加密功能
3.数据转发功能若无集中器中无此档案也可以抄表,抄表路径为集中器直接到表
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0200      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-20170522-Vsp2.00"

#endif

#if (CURRENT_VERSION == SR_JZQ6009_20171108_V006)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.集中器保存冻结数据，在需要定时定量数据时，可将冻结数据转化为定时定量数据。
2.主动上传服务器定时定量数据（由冻结数据转化得到）。
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0210      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-20171108-Vsp2.10"

#endif

#if (CURRENT_VERSION == SR_JZQ6009_20180103_V007)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.当表端主动上报时，集中器的应答帧增加一些命令带回给表端模块。
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0220      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-20180103-Vsp2.20"

#endif


#endif
/**************************************End of file**********************************************/

